# Data Selection

In [3]:
import pandas as pd
dataset =pd.read_csv("a_selection_example_1.csv", index_col = 0)
dataset

     val1  val2 val3
n
100    10    10    C
101    10    20    C
102    10    30    B
103    10    40    B
104    10    50  A

In [4]:
dataset['val3'][104]

'A  '

In [7]:
#numeric index
dataset.loc[104, 'val3']

'A  '

In [8]:
#positional index
dataset.iloc[4, 2]

'A  '

In [9]:
dataset[['val3', 'val2']][0:2]

    val3  val2
n
100    C    10
101    C    20

In [10]:
dataset.loc[range(100, 102), ['val3', 'val2']]

    val3  val2
n
100    C    10
101    C    20

In [11]:
dataset.iloc[range(2), [2,1]]

    val3  val2
n
100    C    10
101    C    20